// ***********************************************************************************
// Микроконтроллер: 1986ВЕ91Т
// Устройство: Отладочная плата 1986ВЕ91Т
// Файл: lсd.c 
// Назначение: Вывод информации на ЖКИ      
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************
#include "lcd.h"

#include "stdio.h"

// Задача по выводу бегущей строки на ЖКИ
__task void U_LCD_Task_Function (void)
{
	uint32_t k = 0;
	uint32_t N = 100;
	float F = 12.89F;
	uint32_t H = 0xA7BF;

	// Строка, выводимая на индикатор
	char msg[20];          

	// Строка, прокручиваемая на индикаторе 
	const char s[] =  "\xD0\xFF\xE7\xE0\xED\xFC \xD0\xC3\xD0\xD2\xD3";          // Рязань РГРТУ
	
	
  // Вывести строку 3 с целой чиселкой
  snprintf (msg, 16, "int %d", N);	
  U_MLT_Put_String (msg, 3);	

  // Вывести строку 4 с вещественной чиселкой
  snprintf (msg, 16, "float %8.2f", F);	
  U_MLT_Put_String (msg, 4);	

  // Вывести строку 5 с 16-ричной целой чиселкой 
  snprintf (msg, 16, "hex 0x%08x", H);	
  U_MLT_Put_String (msg, 5);	
	
	
	while(1)
	{
		// Пауза в тиках системного таймера. Здесь 1тик = 1мс. 
    os_dly_wait (1000);  
		
		// Вывести строку 7 c прокруткой
		U_MLT_Scroll_String (s, 7, k++);
		
	}
}
