// ***********************************************************************************
/// Микроконтроллер: 1986ВЕ91Т
// Устройство: Отладочная плата 1986ВЕ91Т
// Файл: lсd.h 
// Назначение: Вывод информации на ЖКИ      
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

#ifndef __U_LCD
 #define __U_LCD

#include "common.h"
#include "mlt_lcd.h"

// Задача по выводу информации на ЖКИ
__task void U_LCD_Task_Function (void);

#endif 

