// ***********************************************************************************
// Микроконтроллер: 1986ВЕ91Т
// Устройство: Отладочная плата 1986ВЕ91Т
// Файл: main.h 
// Назначение: Главный модуль  
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

#ifndef __MAIN_H
  #define __MAIN_H

#include "common.h"

#include "rst.h"
#include "lcd.h"

// Инициализация задач RTX
__task void Main_Task_Init (void);

#endif 

